## Financial stock datas using alpha vantage api

#### pip install MySQLdb

In [1]:
# import Dependencies
import pandas as pd
import numpy as np
from splinter import Browser
from bs4 import BeautifulSoup as bs
from datetime import datetime as dt
import requests
import json
import re
import datetime as dt
import pymysql
from sqlalchemy import create_engine
pymysql.install_as_MySQLdb()

In [2]:
# Build query Url and List of Stocks ticker
# https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=MSFT&outputsize=full&apikey=demo
api_url = "https://www.alphavantage.co/query?function=TIME_SERIES_DAILY_ADJUSTED&symbol="
api_key = "Y5AE5LOO06SXQ60H"

# List of Stocks ticker
tickers = ["CFG","MS","CME","JPM","GS","PYPL","BRK.A","BRK.B","USB","IBKR","AXP"]

In [3]:
# create and initialize list 
df_list = []
stock_symbol = []
stock_daily_details = []
stock_data = []

In [4]:

import time

In [5]:
for ticker in tickers:
    try:
        url = api_url + ticker + "&outputsize=full&apikey=" + api_key

        stock_details = requests.get(url).json()
        stock_symbol = stock_details["Meta Data"]["2. Symbol"]
        stock_daily_details = stock_details["Time Series (Daily)"]
#         print(stock_daily_details)

        # Save json data for each API call
        with open(f'assets/data/output_api_{ticker}.json', 'w') as outfile:
            json.dump(stock_daily_details, outfile)
            # As our api allow certain number of data to be pulled once so adding the sleep command
            time.sleep(30)

    # If an error is experienced, skip the ticker
    except:
        print("ticker not found. Skipping...")
        pass

### Reading the json file

In [6]:
df_CFG_t = pd.read_json("assets/data/output_api_CFG.json")
df_MS_t = pd.read_json("assets/data/output_api_MS.json")
df_CME_t = pd.read_json("assets/data/output_api_CME.json")
df_JPM_t = pd.read_json("assets/data/output_api_JPM.json")
df_GS_t = pd.read_json("assets/data/output_api_GS.json")
df_PYPL_t = pd.read_json("assets/data/output_api_PYPL.json")
df_BRKA_t = pd.read_json("assets/data/output_api_BRK.A.json")
df_BRKB_t = pd.read_json("assets/data/output_api_BRK.B.json")
df_USB_t = pd.read_json("assets/data/output_api_USB.json")
df_IBKR_t = pd.read_json("assets/data/output_api_USB.json")
df_AXP_t = pd.read_json("assets/data/output_api_USB.json")

### Cleaning datas for Citizens Financial Group (ticker: CFG)Â

In [7]:
df_CFG = df_CFG_t.transpose()

In [8]:
# renaming a column
df_CFG = df_CFG.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted_close','6. volume': 'volume',
                            '7. dividend amount': 'dividend_amount','8. split coefficient': 'split coefficient'})

df_CFG.head()

,open,high,low,close,adjusted_close,volume,dividend_amount,split coefficient
2019-07-09,35.50,36.065,35.260,35.99,35.99,4136185.0,0.0,1.0
2019-07-08,35.58,36.070,35.500,35.60,35.60,3583616.0,0.0,1.0
2019-07-05,35.95,36.420,35.790,35.89,35.89,2758963.0,0.0,1.0
2019-07-03,35.14,35.580,34.940,35.51,35.51,1999016.0,0.0,1.0
2019-07-02,35.43,35.565,34.775,35.02,35.02,4293428.0,0.0,1.0

In [9]:
df_CFG_new = df_CFG[["open", "high", "low","close","adjusted_close","volume"]].copy()
df_CFG_new.head()

             open    high     low  close  adjusted_close     volume
2019-07-09  35.50  36.065  35.260  35.99           35.99  4136185.0
2019-07-08  35.58  36.070  35.500  35.60           35.60  3583616.0
2019-07-05  35.95  36.420  35.790  35.89           35.89  2758963.0
2019-07-03  35.14  35.580  34.940  35.51           35.51  1999016.0
2019-07-02  35.43  35.565  34.775  35.02           35.02  4293428.0

In [10]:
# change type to float
df_CFG_new = df_CFG_new.astype(float)

In [11]:
#  adding ticker column
df_CFG_new ['ticker']= 'CFG'

In [12]:
#reindexing 
df_CFG_new = df_CFG_new.reset_index()
df_CFG_new.head()

       index   open    high     low  close  adjusted_close     volume ticker
0 2019-07-09  35.50  36.065  35.260  35.99           35.99  4136185.0    CFG
1 2019-07-08  35.58  36.070  35.500  35.60           35.60  3583616.0    CFG
2 2019-07-05  35.95  36.420  35.790  35.89           35.89  2758963.0    CFG
3 2019-07-03  35.14  35.580  34.940  35.51           35.51  1999016.0    CFG
4 2019-07-02  35.43  35.565  34.775  35.02           35.02  4293428.0    CFG

In [13]:
# renaming a column
df_CFG_new = df_CFG_new.rename(columns={'index': 'dates'})

In [14]:
df_CFG_new.count()

dates             1205
open              1205
high              1205
low               1205
close             1205
adjusted_close    1205
volume            1205
ticker            1205
dtype: int64

In [15]:
# pd.to_datetime(df_CFG_new['dates']).apply(lambda x: x.date())

### MYSQL database connection

In [16]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stockml_db')

In [17]:
df_CFG_new.to_sql(name='cfg_profile', con=engine, if_exists = 'append', index=False)

In [18]:
pd.read_sql_query('select * from cfg_profile', con=engine).head()

,id,dates,open,high,low,close,adjusted_close,volume,ticker
0,1,2019-07-09,35.50,36.065,35.260,35.99,35.99,4136180.0,CFG
1,2,2019-07-08,35.58,36.070,35.500,35.60,35.60,3583620.0,CFG
2,3,2019-07-05,35.95,36.420,35.790,35.89,35.89,2758960.0,CFG
3,4,2019-07-03,35.14,35.580,34.940,35.51,35.51,1999020.0,CFG
4,5,2019-07-02,35.43,35.565,34.775,35.02,35.02,4293430.0,CFG

### Connect to heroku-postgresql database and load converted DataFrame into database

In [19]:
# ! pip install psycopg2

In [20]:
# import psycopg2
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# df_CFG_new.to_sql(name='CFG_stock', con=engine, if_exists = 'replace', index=False)

In [21]:
# # to add the auto increament primary key "id"
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# with engine.connect() as con:
# #     con.execute ('DROP TABLE "CFG_stock";')
#     con.execute('ALTER TABLE "CFG_stock" ADD COLUMN id SERIAL PRIMARY KEY;')
#     con.execute('ALTER TABLE "CFG_stock" ALTER COLUMN dates TYPE DATE')

In [22]:
# pd.read_sql_query('select * from "CFG_stock";',con=engine).head()

In [23]:
# Finally putting transformed dataframe to csv file
df_CFG_new.to_csv('assets/csv/CFG_stock_details.csv',index = True, header = True)

### Cleaning datas for  Morgan Stanley (MS)

In [24]:
# transposing the dataframe
df_MS = df_MS_t.transpose()

In [25]:
# renaming a column
df_MS = df_MS.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted_close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_MS_new = df_MS[["open", "high", "low","close","adjusted_close","volume"]].copy()
# change type to float
df_MS_new = df_MS_new.astype(float)
#  adding ticker column
df_MS_new ['ticker']= 'MS'

In [26]:
df_MS_new = df_MS_new.reset_index()
# renaming a column
df_MS_new = df_MS_new.rename(columns={'index': 'dates'})

In [27]:
df_MS_new.head()

       dates   open    high     low  close  adjusted_close     volume ticker
0 2019-07-09  43.08  43.870  43.020  43.78           43.78  5497607.0     MS
1 2019-07-08  43.59  43.960  43.285  43.49           43.49  7060245.0     MS
2 2019-07-05  44.49  44.815  44.070  44.21           44.21  6276024.0     MS
3 2019-07-03  43.95  44.145  43.820  43.99           43.99  4470788.0     MS
4 2019-07-02  43.70  43.925  43.400  43.83           43.83  8234802.0     MS

### MYSQL database connection

In [28]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stockml_db')

In [29]:
df_MS_new.to_sql(name='ms_profile', con=engine, if_exists = 'append', index=False)

In [30]:
pd.read_sql_query('select * from ms_profile', con=engine).head()

,id,dates,open,high,low,close,adjusted_close,volume,ticker
0,1,2019-07-09,43.08,43.870,43.020,43.78,43.78,5497610.0,MS
1,2,2019-07-08,43.59,43.960,43.285,43.49,43.49,7060240.0,MS
2,3,2019-07-05,44.49,44.815,44.070,44.21,44.21,6276020.0,MS
3,4,2019-07-03,43.95,44.145,43.820,43.99,43.99,4470790.0,MS
4,5,2019-07-02,43.70,43.925,43.400,43.83,43.83,8234800.0,MS

### Connect to local database and load converted DataFrame into database

In [31]:
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# df_MS_new.to_sql(name='MS_stock', con=engine, if_exists = 'replace', index=False)

In [32]:
# # to add the auto increament primary key "id"
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# with engine.connect() as con:
#     con.execute(' ALTER TABLE "MS_stock" ADD COLUMN id SERIAL PRIMARY KEY;')
#     con.execute('ALTER TABLE "MS_stock" ALTER COLUMN dates TYPE DATE')

In [33]:
# df_MS = pd.read_sql_query('select * from "MS_stock"',con=engine)
# df_MS.head()

In [34]:
# Finally putting transformed dataframe to csv file
df_MS_new.to_csv('assets/csv/MS_stock_details.csv',index = True, header = True)

### Cleaning datas for CME Group (CME)

In [35]:
# transposing the dataframe
df_CME = df_CME_t.transpose()

In [36]:
# renaming a column
df_CME = df_CME.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted_close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_CME_new = df_CME[["open", "high", "low","close","adjusted_close","volume"]].copy()
# change type to float
df_CME_new = df_CME_new.astype(float)
#  adding ticker column
df_CME_new ['ticker']= 'CME'

In [37]:
df_CME_new = df_CME_new.reset_index()
# renaming a column
df_CME_new = df_CME_new.rename(columns={'index': 'dates'})

In [38]:
df_CME_new.tail()

          dates   open   high    low  close  adjusted_close     volume ticker
4169 2002-12-12  45.06  45.06  43.60  43.91          5.4893   271100.0    CME
4170 2002-12-11  42.70  45.50  42.30  45.06          5.6331   509800.0    CME
4171 2002-12-10  42.05  43.30  41.65  42.75          5.3443   344600.0    CME
4172 2002-12-09  42.70  42.80  41.14  42.02          5.2530   629900.0    CME
4173 2002-12-06  39.00  43.20  38.90  42.90          5.3631  5510200.0    CME

### MYSQL database connection

In [39]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stockml_db')

In [40]:
df_CME_new.to_sql(name='cme_profile', con=engine, if_exists = 'append', index=False)

In [41]:
pd.read_sql_query('select * from cme_profile', con=engine).head()

,id,dates,open,high,low,close,adjusted_close,volume,ticker
0,1,2019-07-09,201.30,202.12,200.473,201.99,201.99,744278.0,CME
1,2,2019-07-08,202.51,203.53,201.220,201.99,201.99,716346.0,CME
2,3,2019-07-05,201.83,203.35,200.590,202.81,202.81,884617.0,CME
3,4,2019-07-03,200.00,201.70,199.200,201.67,201.67,865103.0,CME
4,5,2019-07-02,196.30,200.36,195.360,199.77,199.77,1031550.0,CME

### Connect to heroku-postgresql database and load converted DataFrame into database

In [42]:
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# df_CME_new.to_sql(name='CME_stock', con=engine, if_exists = 'replace', index=False)

In [43]:
# # to add the auto increament primary key "id"
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# with engine.connect() as con:
#     con.execute(' ALTER TABLE "CME_stock" ADD COLUMN id SERIAL PRIMARY KEY;')
#     con.execute('ALTER TABLE "CME_stock" ALTER COLUMN dates TYPE DATE')

In [44]:
# pd.read_sql_query('select * from "CME_stock"', con=engine).head()

In [45]:
# Finally putting transformed dataframe to csv file
df_CME_new.to_csv('assets/csv/CME_stock_details.csv',index = True, header = True)

### Cleaning datas for  JPMorgan Chase & Co. (JPM)

In [46]:
# transposing the dataframe
df_JPM = df_JPM_t.transpose()

In [47]:
# renaming a column
df_JPM = df_JPM.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted_close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_JPM_new = df_JPM[["open", "high", "low","close","adjusted_close","volume"]].copy()
# change type to float
df_JPM_new = df_JPM_new.astype(float)
#  adding ticker column
df_JPM_new ['ticker']= 'JPM'

In [48]:
df_JPM_new = df_JPM_new.reset_index()
# renaming a column
df_JPM_new = df_JPM_new.rename(columns={'index': 'dates'})

In [49]:
df_JPM_new.head()

,dates,open,high,low,close,adjusted_close,volume,ticker
0,2019-07-09,112.28,113.49,112.1503,113.35,113.3500,8307514.0,JPM
1,2019-07-08,112.96,113.48,112.5000,112.87,112.8700,6916153.0,JPM
2,2019-07-05,113.51,114.27,112.9200,113.49,113.4900,7929536.0,JPM
3,2019-07-03,113.34,113.87,112.2600,112.82,112.8200,6849443.0,JPM
4,2019-07-02,113.51,114.20,113.2200,113.80,112.9987,10182625.0,JPM

### MYSQL database connection

In [50]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stockml_db')

In [51]:
df_JPM_new.to_sql(name='jpm_profile', con=engine, if_exists = 'append', index=False)
pd.read_sql_query('select * from jpm_profile', con=engine).head()

,id,dates,open,high,low,close,adjusted_close,volume,ticker
0,1,2019-07-09,112.28,113.49,112.15,113.35,113.350,8307510.0,JPM
1,2,2019-07-08,112.96,113.48,112.50,112.87,112.870,6916150.0,JPM
2,3,2019-07-05,113.51,114.27,112.92,113.49,113.490,7929540.0,JPM
3,4,2019-07-03,113.34,113.87,112.26,112.82,112.820,6849440.0,JPM
4,5,2019-07-02,113.51,114.20,113.22,113.80,112.999,10182600.0,JPM

### Connect to heroku-postgresql database and load converted DataFrame into database

In [52]:
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# df_JPM_new.to_sql(name='JPM_stock', con=engine, if_exists = 'replace', index=False)

In [53]:
# # to add the auto increament primary key "id"
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# with engine.connect() as con:
#     con.execute(' ALTER TABLE "JPM_stock" ADD COLUMN id SERIAL PRIMARY KEY;')
#     con.execute('ALTER TABLE "JPM_stock" ALTER COLUMN dates TYPE DATE')

In [54]:
# pd.read_sql_query('select * from "JPM_stock"', con=engine).head()

In [55]:
# Finally putting transformed dataframe to csv file
df_JPM_new.to_csv('assets/csv/JPM_stock_details.csv',index = True, header = True)

### Cleaning datas for  Goldman Sachs Group (GS)Â

In [56]:
# transposing the dataframe
df_GS = df_GS_t.transpose()

In [57]:
# renaming a column
df_GS = df_GS.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted_close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_GS_new = df_GS[["open", "high", "low","close","adjusted_close","volume"]].copy()
# change type to float
df_GS_new = df_GS_new.astype(float)
#  adding ticker column
df_GS_new ['ticker']= 'GS'

In [58]:
df_GS_new = df_GS_new.reset_index()
# renaming a column
df_GS_new = df_GS_new.rename(columns={'index': 'dates'})

In [59]:
df_GS_new.head()

,dates,open,high,low,close,adjusted_close,volume,ticker
0,2019-07-09,203.75,207.940,203.540,207.77,207.77,1767045.0,GS
1,2019-07-08,206.36,207.250,204.705,205.75,205.75,1853892.0,GS
2,2019-07-05,206.86,208.760,206.200,207.90,207.90,1511445.0,GS
3,2019-07-03,207.30,207.400,205.230,206.04,206.04,978795.0,GS
4,2019-07-02,205.40,206.305,204.160,205.98,205.98,1626880.0,GS

In [60]:
df_GS_new.head()

,dates,open,high,low,close,adjusted_close,volume,ticker
0,2019-07-09,203.75,207.940,203.540,207.77,207.77,1767045.0,GS
1,2019-07-08,206.36,207.250,204.705,205.75,205.75,1853892.0,GS
2,2019-07-05,206.86,208.760,206.200,207.90,207.90,1511445.0,GS
3,2019-07-03,207.30,207.400,205.230,206.04,206.04,978795.0,GS
4,2019-07-02,205.40,206.305,204.160,205.98,205.98,1626880.0,GS

In [61]:
# Finally putting transformed dataframe to csv file
df_GS_new.to_csv('assets/csv/GS_stock_details.csv',index = True, header = True)

### MYSQL database connection

In [62]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stockml_db')

In [63]:
df_GS_new.to_sql(name='gs_profile', con=engine, if_exists = 'append', index=False)

In [64]:
pd.read_sql_query('select * from gs_profile', con=engine).head()

,id,dates,open,high,low,close,adjusted_close,volume,ticker
0,1,2019-07-09,203.75,207.940,203.540,207.77,207.77,1767040.0,GS
1,2,2019-07-08,206.36,207.250,204.705,205.75,205.75,1853890.0,GS
2,3,2019-07-05,206.86,208.760,206.200,207.90,207.90,1511440.0,GS
3,4,2019-07-03,207.30,207.400,205.230,206.04,206.04,978795.0,GS
4,5,2019-07-02,205.40,206.305,204.160,205.98,205.98,1626880.0,GS

### Connect to heroku-postgresql database and load converted DataFrame into database

In [65]:
# import psycopg2
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# df_GS_new.to_sql(name='GS_stock', con=engine, if_exists = 'replace', index=False)

In [66]:
# # to add the auto increament primary key "id"
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# with engine.connect() as con:
#     con.execute(' ALTER TABLE "GS_stock" ADD COLUMN id SERIAL PRIMARY KEY;')
#     con.execute('ALTER TABLE "GS_stock" ALTER COLUMN dates TYPE DATE')

In [67]:
# pd.read_sql_query('select * from "GS_stock"', con=engine).head()

### Cleaning datas for  PayPal Holdings (PYPL)

In [68]:
# transposing the dataframe
df_PYPL = df_PYPL_t.transpose()

In [69]:
# renaming a column
df_PYPL = df_PYPL.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted_close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_PYPL_new = df_PYPL[["open", "high", "low","close","adjusted_close","volume"]].copy()
# change type to float
df_PYPL_new = df_PYPL_new.astype(float)
#  adding ticker column
df_PYPL_new ['ticker']= 'PYPL'

In [70]:
df_PYPL_new = df_PYPL_new.reset_index()
# renaming a column
df_PYPL_new = df_PYPL_new.rename(columns={'index': 'dates'})

In [71]:
df_PYPL_new.head()

,dates,open,high,low,close,adjusted_close,volume,ticker
0,2019-07-09,116.37,118.620,116.2500,118.37,118.37,3694300.0,PYPL
1,2019-07-08,116.34,117.225,115.1401,116.95,116.95,4336099.0,PYPL
2,2019-07-05,116.54,117.400,114.6900,117.16,117.16,3801715.0,PYPL
3,2019-07-03,116.88,117.720,116.0600,117.68,117.68,3288929.0,PYPL
4,2019-07-02,115.18,116.200,114.5800,116.17,116.17,4155388.0,PYPL

### Connect to heroku-postgresql database and load converted DataFrame into database

In [72]:
# import psycopg2
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# df_PYPL_new.to_sql(name='PYPL_stock', con=engine, if_exists = 'replace', index=False)

In [73]:
# # to add the auto increament primary key "id"
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# with engine.connect() as con:
#     con.execute(' ALTER TABLE "PYPL_stock" ADD COLUMN id SERIAL PRIMARY KEY;')
#     con.execute('ALTER TABLE "PYPL_stock" ALTER COLUMN dates TYPE DATE;')

In [74]:
# pd.read_sql_query('select * from "PYPL_stock"', con=engine).head()

In [75]:
# Finally putting transformed dataframe to csv file
df_PYPL_new.to_csv('assets/csv/PYPL_stock_details.csv',index = True, header = True)

### MYSQL database connection

In [76]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stockml_db')

df_PYPL_new.to_sql(name='pypl_profile', con=engine, if_exists = 'append', index=False)

pd.read_sql_query('select * from pypl_profile', con=engine).head()

,id,dates,open,high,low,close,adjusted_close,volume,ticker
0,1,2019-07-09,116.37,118.620,116.25,118.37,118.37,3694300.0,PYPL
1,2,2019-07-08,116.34,117.225,115.14,116.95,116.95,4336100.0,PYPL
2,3,2019-07-05,116.54,117.400,114.69,117.16,117.16,3801720.0,PYPL
3,4,2019-07-03,116.88,117.720,116.06,117.68,117.68,3288930.0,PYPL
4,5,2019-07-02,115.18,116.200,114.58,116.17,116.17,4155390.0,PYPL

### Cleaning datas for  Berkshire Hathaway (BRK.A)Â

In [77]:
# transposing the dataframe
df_BRKA = df_BRKA_t.transpose()

In [78]:
# renaming a column
df_BRKA = df_BRKA.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted_close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_BRKA_new = df_BRKA[["open", "high", "low","close","adjusted_close","volume"]].copy()
# change type to float
df_BRKA_new = df_BRKA_new.astype(float)
#  adding ticker column
df_BRKA_new ['ticker']= 'BRK.A'

In [79]:
df_BRKA_new = df_BRKA_new.reset_index()
# renaming a column
df_BRKA_new = df_BRKA_new.rename(columns={'index': 'dates'})

In [80]:
df_BRKA_new.head()

,dates,open,high,low,close,adjusted_close,volume,ticker
0,2019-07-09,321000.00,322347.0,319500.00,322200.0,322200.0,127.0,BRK.A
1,2019-07-08,321400.00,323567.0,320974.00,322451.0,322451.0,129.0,BRK.A
2,2019-07-05,322600.00,323642.0,320918.00,323149.0,323149.0,190.0,BRK.A
3,2019-07-03,321815.01,322900.0,319119.59,322900.0,322900.0,156.0,BRK.A
4,2019-07-02,320600.01,323250.0,320413.00,321515.0,321515.0,188.0,BRK.A

In [81]:
df_BRKA_new.count()

dates             5413
open              5413
high              5413
low               5413
close             5413
adjusted_close    5413
volume            5413
ticker            5413
dtype: int64

### Connect to heroku-postgresql database and load converted DataFrame into database

In [82]:
# import psycopg2
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# df_BRKA_new.to_sql(name='BRKA_stock', con=engine, if_exists = 'replace', index=False)

In [83]:
# # to add the auto increament primary key "id"
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# with engine.connect() as con:
#     con.execute(' ALTER TABLE "BRKA_stock" ADD COLUMN id SERIAL PRIMARY KEY;')
#     con.execute('ALTER TABLE "BRKA_stock" ALTER COLUMN dates TYPE DATE;')

In [84]:
# df_BRKA = pd.read_sql_query('select * from "BRKA_stock"', con=engine)
# df_BRKA.head()

In [85]:
# Finally putting transformed dataframe to csv file
df_BRKA_new.to_csv('assets/csv/BRKA_stock_details.csv',index = True, header = True)

### MYSQL database connection

In [86]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stockml_db')

df_BRKA_new.to_sql(name='brka_profile', con=engine, if_exists = 'append', index=False)

pd.read_sql_query('select * from brka_profile', con=engine).head()

,id,dates,open,high,low,close,adjusted_close,volume,ticker
0,1,2019-07-09,321000.0,322347.0,319500.0,322200.0,322200.0,127.0,BRK.A
1,2,2019-07-08,321400.0,323567.0,320974.0,322451.0,322451.0,129.0,BRK.A
2,3,2019-07-05,322600.0,323642.0,320918.0,323149.0,323149.0,190.0,BRK.A
3,4,2019-07-03,321815.0,322900.0,319120.0,322900.0,322900.0,156.0,BRK.A
4,5,2019-07-02,320600.0,323250.0,320413.0,321515.0,321515.0,188.0,BRK.A

### Cleaning datas for  Berkshire Hathaway (BRK.B)Â

In [87]:
# transposing the dataframe
df_BRKB = df_BRKB_t.transpose()

In [88]:
# renaming a column
df_BRKB = df_BRKB.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted_close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_BRKB_new = df_BRKB[["open", "high", "low","close","adjusted_close","volume"]].copy()
# change type to float
df_BRKB_new = df_BRKB_new.astype(float)
#  adding ticker column
df_BRKB_new ['ticker']= 'BRK.B'

In [89]:
df_BRKB_new = df_BRKB_new.reset_index()
# renaming a column
df_BRKB_new = df_BRKB_new.rename(columns={'index': 'dates'})

In [90]:
df_BRKB_new.head()

       dates    open    high     low   close  adjusted_close     volume ticker
0 2019-07-09  213.02  214.92  212.97  214.75          214.75  2382912.0  BRK.B
1 2019-07-08  214.00  215.80  213.91  215.13          215.13  2978408.0  BRK.B
2 2019-07-05  215.13  215.77  213.90  215.25          215.25  3324183.0  BRK.B
3 2019-07-03  215.00  215.25  212.66  215.16          215.16  2489136.0  BRK.B
4 2019-07-02  214.38  215.59  213.40  214.54          214.54  3054355.0  BRK.B

### Connect to heroku-postgresql database and load converted DataFrame into database

In [91]:
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# df_BRKB_new.to_sql(name='BRKB_stock', con=engine, if_exists = 'replace', index=False)

In [92]:
# # to add the auto increament primary key "id"
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# with engine.connect() as con:
#     con.execute(' ALTER TABLE "BRKB_stock" ADD COLUMN id SERIAL PRIMARY KEY;')
#     con.execute('ALTER TABLE "BRKB_stock" ALTER COLUMN dates TYPE DATE')

In [93]:
# pd.read_sql_query('select * from "BRKB_stock"', con=engine).head()

In [94]:
# Finally putting transformed dataframe to csv file
df_BRKB_new.to_csv('assets/csv/BRKB_stock_details.csv',index = True, header = True)

### MYSQL database connection

In [95]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stockml_db')

df_BRKB_new.to_sql(name='brkb_profile', con=engine, if_exists = 'append', index=False)

pd.read_sql_query('select * from brkb_profile', con=engine).head()

,id,dates,open,high,low,close,adjusted_close,volume,ticker
0,1,2019-07-09,213.02,214.92,212.97,214.75,214.75,2382910.0,BRK.B
1,2,2019-07-08,214.00,215.80,213.91,215.13,215.13,2978410.0,BRK.B
2,3,2019-07-05,215.13,215.77,213.90,215.25,215.25,3324180.0,BRK.B
3,4,2019-07-03,215.00,215.25,212.66,215.16,215.16,2489140.0,BRK.B
4,5,2019-07-02,214.38,215.59,213.40,214.54,214.54,3054360.0,BRK.B

### Cleaning datas for   U.S. Bancorp (USB)

In [96]:
# transposing the dataframe
df_USB = df_USB_t.transpose()

In [97]:
# renaming a column
df_USB = df_USB.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted_close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_USB_new = df_USB[["open", "high", "low","close","adjusted_close","volume"]].copy()
# change type to float
df_USB_new = df_USB_new.astype(float)
#  adding ticker column
df_USB_new ['ticker']= 'USB'

In [98]:
df_USB_new = df_USB_new.reset_index()
# renaming a column
df_USB_new = df_USB_new.rename(columns={'index': 'dates'})

In [99]:
df_USB_new.count()

dates             5413
open              5413
high              5413
low               5413
close             5413
adjusted_close    5413
volume            5413
ticker            5413
dtype: int64

In [100]:
df_USB_new.head()

       dates   open    high     low  close  adjusted_close     volume ticker
0 2019-07-09  52.79  53.350  52.710  53.34           53.34  3521924.0    USB
1 2019-07-08  53.33  53.680  52.910  53.10           53.10  4123934.0    USB
2 2019-07-05  53.55  53.840  53.350  53.68           53.68  3195295.0    USB
3 2019-07-03  53.07  53.345  52.900  53.25           53.25  2102684.0    USB
4 2019-07-02  52.88  53.190  52.625  52.93           52.93  3175187.0    USB

### Connect to heroku-postgresql database and load converted DataFrame into database

In [101]:
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# df_USB_new.to_sql(name='USB_stock', con=engine, if_exists = 'replace', index=False)

In [102]:
# # to add the auto increament primary key "id"
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# with engine.connect() as con:
#     con.execute(' ALTER TABLE "USB_stock" ADD COLUMN id SERIAL PRIMARY KEY;')
#     con.execute('ALTER TABLE "USB_stock" ALTER COLUMN dates TYPE DATE')

In [103]:
# pd.read_sql_query('select * from "USB_stock"', con=engine).head()

In [104]:
# Finally putting transformed dataframe to csv file
df_USB_new.to_csv('assets/csv/USB_stock_details.csv',index = True, header = True)

### MYSQL database connection

In [105]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stockml_db')

df_USB_new.to_sql(name='usb_profile', con=engine, if_exists = 'append', index=False)

pd.read_sql_query('select * from usb_profile', con=engine).head()

,id,dates,open,high,low,close,adjusted_close,volume,ticker
0,1,2019-07-09,52.79,53.350,52.710,53.34,53.34,3521920.0,USB
1,2,2019-07-08,53.33,53.680,52.910,53.10,53.10,4123930.0,USB
2,3,2019-07-05,53.55,53.840,53.350,53.68,53.68,3195300.0,USB
3,4,2019-07-03,53.07,53.345,52.900,53.25,53.25,2102680.0,USB
4,5,2019-07-02,52.88,53.190,52.625,52.93,52.93,3175190.0,USB

### Cleaning datas for  Interactive Brokers (IBKR)

In [106]:
# transposing the dataframe
df_IBKR = df_IBKR_t.transpose()

In [107]:
# renaming a column
df_IBKR = df_IBKR.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted_close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_IBKR_new = df_IBKR[["open", "high", "low","close","adjusted_close","volume"]].copy()
# change type to float
df_IBKR_new = df_IBKR_new.astype(float)
#  adding ticker column
df_IBKR_new ['ticker']= 'IBKR'

In [108]:
df_IBKR_new = df_IBKR_new.reset_index()
# renaming a column
df_IBKR_new = df_IBKR_new.rename(columns={'index': 'dates'})

In [109]:
df_IBKR_new.count()

dates             5413
open              5413
high              5413
low               5413
close             5413
adjusted_close    5413
volume            5413
ticker            5413
dtype: int64

In [110]:
df_IBKR_new.head()

       dates   open    high     low  close  adjusted_close     volume ticker
0 2019-07-09  52.79  53.350  52.710  53.34           53.34  3521924.0   IBKR
1 2019-07-08  53.33  53.680  52.910  53.10           53.10  4123934.0   IBKR
2 2019-07-05  53.55  53.840  53.350  53.68           53.68  3195295.0   IBKR
3 2019-07-03  53.07  53.345  52.900  53.25           53.25  2102684.0   IBKR
4 2019-07-02  52.88  53.190  52.625  52.93           52.93  3175187.0   IBKR

### Connect to heroku-postgresql database and load converted DataFrame into database

In [111]:
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# df_IBKR_new.to_sql(name='IBKR_stock', con=engine, if_exists = 'replace', index=False)

In [112]:
# # to add the auto increament primary key "id"
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# with engine.connect() as con:
#     con.execute(' ALTER TABLE "IBKR_stock" ADD COLUMN id SERIAL PRIMARY KEY;')
#     con.execute('ALTER TABLE "IBKR_stock" ALTER COLUMN dates TYPE DATE')

In [113]:
# pd.read_sql_query('select * from "IBKR_stock"', con=engine).head()

In [114]:
# Finally putting transformed dataframe to csv file
df_IBKR_new.to_csv('assets/csv/IBKR_stock_details.csv',index = True, header = True)

### MYSQL database connection

In [115]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stockml_db')

df_IBKR_new.to_sql(name='ibkr_profile', con=engine, if_exists = 'append', index=False)

pd.read_sql_query('select * from ibkr_profile', con=engine).head()

,id,dates,open,high,low,close,adjusted_close,volume,ticker
0,1,2019-07-09,52.79,53.350,52.710,53.34,53.34,3521920.0,IBKR
1,2,2019-07-08,53.33,53.680,52.910,53.10,53.10,4123930.0,IBKR
2,3,2019-07-05,53.55,53.840,53.350,53.68,53.68,3195300.0,IBKR
3,4,2019-07-03,53.07,53.345,52.900,53.25,53.25,2102680.0,IBKR
4,5,2019-07-02,52.88,53.190,52.625,52.93,52.93,3175190.0,IBKR

### Cleaning datas for American Express Co. (AXP)

In [116]:
# transposing the dataframe
df_AXP = df_AXP_t.transpose()

In [117]:
# renaming a column
df_AXP = df_AXP.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted_close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_AXP_new = df_AXP[["open", "high", "low","close","adjusted_close","volume",]].copy()
# change type to float
df_AXP_new = df_AXP_new.astype(float)
#  adding ticker column
df_AXP_new ['ticker']= 'AXP'

In [118]:
df_AXP_new = df_AXP_new.reset_index()
# renaming a column
df_AXP_new = df_AXP_new.rename(columns={'index': 'dates'})

In [119]:
df_AXP_new.count()

dates             5413
open              5413
high              5413
low               5413
close             5413
adjusted_close    5413
volume            5413
ticker            5413
dtype: int64

In [120]:
df_AXP_new.head()

       dates   open    high     low  close  adjusted_close     volume ticker
0 2019-07-09  52.79  53.350  52.710  53.34           53.34  3521924.0    AXP
1 2019-07-08  53.33  53.680  52.910  53.10           53.10  4123934.0    AXP
2 2019-07-05  53.55  53.840  53.350  53.68           53.68  3195295.0    AXP
3 2019-07-03  53.07  53.345  52.900  53.25           53.25  2102684.0    AXP
4 2019-07-02  52.88  53.190  52.625  52.93           52.93  3175187.0    AXP

### Connect to heroku-postgresql database and load converted DataFrame into database

In [121]:
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# df_AXP_new.to_sql(name='AXP_stock', con=engine, if_exists = 'replace', index=False)

In [122]:
# # to add the auto increament primary key "id"
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# with engine.connect() as con:
#     con.execute(' ALTER TABLE "AXP_stock" ADD COLUMN id SERIAL PRIMARY KEY;')
#     con.execute('ALTER TABLE "AXP_stock" ALTER COLUMN dates TYPE DATE')

In [123]:
# pd.read_sql_query('select * from "AXP_stock"', con=engine).head()

In [124]:
# Finally putting transformed dataframe to csv file
df_AXP_new.to_csv('assets/csv/AXP_stock_details.csv',index = True, header = True)

### MYSQL database connection

In [125]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stockml_db')

df_AXP_new.to_sql(name='axp_profile', con=engine, if_exists = 'append', index=False)

pd.read_sql_query('select * from axp_profile', con=engine).head()

,id,dates,open,high,low,close,adjusted_close,volume,ticker
0,1,2019-07-09,52.79,53.350,52.710,53.34,53.34,3521920.0,AXP
1,2,2019-07-08,53.33,53.680,52.910,53.10,53.10,4123930.0,AXP
2,3,2019-07-05,53.55,53.840,53.350,53.68,53.68,3195300.0,AXP
3,4,2019-07-03,53.07,53.345,52.900,53.25,53.25,2102680.0,AXP
4,5,2019-07-02,52.88,53.190,52.625,52.93,52.93,3175190.0,AXP

### Concating the dataframe to eventually make a final dataframe

In [126]:
df_final = pd.concat([df_CFG_new,df_MS_new,df_CME_new,df_JPM_new,df_GS_new,df_PYPL_new,df_BRKA_new,df_BRKB_new,df_USB_new,df_IBKR_new,df_AXP_new]).drop_duplicates()
df_final.head()

       dates   open    high     low  close  adjusted_close     volume ticker
0 2019-07-09  35.50  36.065  35.260  35.99           35.99  4136185.0    CFG
1 2019-07-08  35.58  36.070  35.500  35.60           35.60  3583616.0    CFG
2 2019-07-05  35.95  36.420  35.790  35.89           35.89  2758963.0    CFG
3 2019-07-03  35.14  35.580  34.940  35.51           35.51  1999016.0    CFG
4 2019-07-02  35.43  35.565  34.775  35.02           35.02  4293428.0    CFG

In [127]:
# Sorting values of dates in decending order
df_sort = df_final.sort_values(['dates'], ascending=[False])
# to do reset index
df_stock = df_sort.reset_index()
df_stock.head(10)

,index,dates,open,high,low,close,adjusted_close,volume,ticker
0,0,2019-07-09,35.50,36.065,35.2600,35.99,35.99,4136185.0,CFG
1,0,2019-07-09,52.79,53.350,52.7100,53.34,53.34,3521924.0,IBKR
2,0,2019-07-09,43.08,43.870,43.0200,43.78,43.78,5497607.0,MS
3,0,2019-07-09,321000.00,322347.000,319500.0000,322200.00,322200.00,127.0,BRK.A
4,0,2019-07-09,116.37,118.620,116.2500,118.37,118.37,3694300.0,PYPL
5,0,2019-07-09,213.02,214.920,212.9700,214.75,214.75,2382912.0,BRK.B
6,0,2019-07-09,52.79,53.350,52.7100,53.34,53.34,3521924.0,USB
7,0,2019-07-09,112.28,113.490,112.1503,113.35,113.35,8307514.0,JPM
8,0,2019-07-09,203.75,207.940,203.5400,207.77,207.77,1767045.0,GS
9,0,2019-07-09,201.30,202.120,200.4728,201.99,201.99,744278.0,CME

In [128]:
df_stock = df_stock[["dates", "open", "high", "low", "close", "adjusted_close", "volume", "ticker"]].copy()
df_stock.head(10)

,dates,open,high,low,close,adjusted_close,volume,ticker
0,2019-07-09,35.50,36.065,35.2600,35.99,35.99,4136185.0,CFG
1,2019-07-09,52.79,53.350,52.7100,53.34,53.34,3521924.0,IBKR
2,2019-07-09,43.08,43.870,43.0200,43.78,43.78,5497607.0,MS
3,2019-07-09,321000.00,322347.000,319500.0000,322200.00,322200.00,127.0,BRK.A
4,2019-07-09,116.37,118.620,116.2500,118.37,118.37,3694300.0,PYPL
5,2019-07-09,213.02,214.920,212.9700,214.75,214.75,2382912.0,BRK.B
6,2019-07-09,52.79,53.350,52.7100,53.34,53.34,3521924.0,USB
7,2019-07-09,112.28,113.490,112.1503,113.35,113.35,8307514.0,JPM
8,2019-07-09,203.75,207.940,203.5400,207.77,207.77,1767045.0,GS
9,2019-07-09,201.30,202.120,200.4728,201.99,201.99,744278.0,CME

### Connect to heroku-postgresql database and load converted DataFrame into database

In [129]:
# engine = create_engine('postgres://xceiqrenotzqbw:a808f4c0025de8def28e3634b65274076745bd42160a69e04f794faa8667a092@ec2-50-19-254-63.compute-1.amazonaws.com:5432/d1fj3p42e5lp7k')
# df_stock.to_sql(name='Stock_all', con=engine, if_exists = 'replace', index=False)
# with engine.connect() as con:
#     con.execute(' ALTER TABLE "Stock_all" ADD COLUMN id SERIAL PRIMARY KEY;')
#     con.execute('ALTER TABLE "Stock_all" ALTER COLUMN dates TYPE DATE;')

In [130]:
# pd.read_sql_query('select * from "Stock_all"', con=engine).head(10)

### Final stock dataframe to csv

In [131]:
# Finally putting transformed dataframe to csv file
df_stock.to_csv('assets/csv/Merged_stock_details.csv',index = True, header = True)

### MYSQL database connection

In [132]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stockml_db')

df_stock.to_sql(name='Stocks_profile', con=engine, if_exists = 'append', index=False)

pd.read_sql_query('select * from Stocks_profile', con=engine).head()

C:\Users\Owner\anaconda\Anaconda3\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'Stocks_profile' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

,id,dates,open,high,low,close,adjusted_close,volume,ticker
0,1,2019-07-09,35.50,36.065,35.26,35.99,35.99,4136180.0,CFG
1,2,2019-07-09,52.79,53.350,52.71,53.34,53.34,3521920.0,IBKR
2,3,2019-07-09,43.08,43.870,43.02,43.78,43.78,5497610.0,MS
3,4,2019-07-09,321000.00,322347.000,319500.00,322200.00,322200.00,127.0,BRK.A
4,5,2019-07-09,116.37,118.620,116.25,118.37,118.37,3694300.0,PYPL

In [133]:
pd.read_sql_query('select * from Stocks_profile', con=engine).tail()

,id,dates,open,high,low,close,adjusted_close,volume,ticker
49343,49344,1998-01-02,108.62,110.62,107.56,110.62,19.3383,971900.0,JPM
49344,49345,1998-01-02,1539.00,1539.00,1529.00,1529.00,30.5800,1300.0,BRK.B
49345,49346,1998-01-02,112.00,112.94,111.62,112.63,14.5579,581133.0,USB
49346,49347,1998-01-02,58.50,59.12,57.88,58.75,17.2670,1467900.0,MS
49347,49348,1998-01-02,112.00,112.94,111.62,112.63,14.5579,581133.0,AXP